{
    "passwordDiffNew": "Please enter the same password in both New Password fields.",
    "passwordOldNewSame": "Old password and new password fields cannot contain the same string.",
    "passwordReqFail": "Please ensure your new password is between 8 to 10 characters. It must also contain at least one alphabet, one number and one special character.",
    "userPassWrong": "Username or Password is incorrect.",
    "internalErrorDB": "An Internal Error occurred. (Database)",
    "accountDisabled": "Account is disabled.",
    "internalErrorArgon2": "An Internal Error occurred. (argon2)",
    "passwordOldWrong": "Old Password is incorrect.",
    "internalErrorWebsite": "An Internal Error occurred. (Website)",
    "internalErrorGeneric": "An Internal Error occurred.",
    "nothingToModify": "There is nothing to modify.",
    "deleteAppFailed": "Delete Application operation failed. Please ensure selected application does not have any plans and/or tasks referring to it.",
    "createPlanNoPermits": "You are not permitted to create plans for any existing application.",
    "createPlanNameTaken": "A plan with this name already exists: ",
    "listPlanNoPlans": "No plans found. If you are expecting to see a plan in this list, you may not have permissions for the application it is attached to.",
    "userNoUsergroups": "You do not belong in any usergroups. Please contact administration.",
    "createTaskNoPermits": "You are not permitted to create tasks for any existing application.",
    "createTaskIDTaken": "Please contact administration. A task with the following ID already exists: ",
    "createTaskRNumCannotIncrement": "Please contact administration. There was an error when trying to increment RNumber of application: ",
    "listTasksNoApps": "No tasks to display. If you are expecting tasks to show up, you may not have permissions for the applications they are associated with.",
    "userNotLoggedIn": "User not logged in.",
    "taskActionNotAllowed": "The action you are trying to perform is not allowed. The task's state might have changed. Please refresh and try again."
}